Revit 2021.1 API
ExportEnergyModelType Enumeration
 This enum is used to define if energy model used for gbXML export should be based on rooms/spaces or building elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2015
Syntax
C#
public enum ExportEnergyModelType
Visual Basic
Public Enumeration ExportEnergyModelType
Visual C++
public enum class ExportEnergyModelType
Members
Member name | Description
SpatialElement |  Energy model based on rooms or spaces.
BuildingElement |  The building element based energy analytical model.
See Also
Autodesk.Revit.DB Namespace